public/posts/easier-recursion/index.html
<!DOCTYPE html>
<html lang="en">
<head>
  
    <title>Easier Recursion :: The Programmer&#39;s Stone</title>
  
  <meta http-equiv="content-type" content="text/html; charset=utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta name="description" content=" I definitely understand the sentiment behind the L. Peter Deutsch quote, &amp;#34;To iterate is human, to recurse divine.&amp;#34; I enjoy an elegant recursive solution as much as other programmers, but lately I&amp;#39;ve been playing with another style of coding up similar needs that might just be easier and more flexible.
" />
<meta name="keywords" content="" />

  <meta name="robots" content="noodp" />

<link rel="canonical" href="https://programmersstone.blog/posts/easier-recursion/" />






  
  
  
  
  
  <link rel="stylesheet" href="https://programmersstone.blog/styles.css">







  <link rel="shortcut icon" href="https://programmersstone.blog/favicon.ico">



<meta name="twitter:card" content="summary" />



<meta property="og:locale" content="en" />
<meta property="og:type" content="article" />
<meta property="og:title" content="Easier Recursion">
<meta property="og:description" content=" I definitely understand the sentiment behind the L. Peter Deutsch quote, &amp;#34;To iterate is human, to recurse divine.&amp;#34; I enjoy an elegant recursive solution as much as other programmers, but lately I&amp;#39;ve been playing with another style of coding up similar needs that might just be easier and more flexible.
" />
<meta property="og:url" content="https://programmersstone.blog/posts/easier-recursion/" />
<meta property="og:site_name" content="The Programmer&#39;s Stone" />

  
    <meta property="og:image" content="https://programmersstone.blog/favicon.ico">
  

<meta property="og:image:width" content="1200">
<meta property="og:image:height" content="627">


  <meta property="article:published_time" content="2023-07-23 00:00:00 &#43;0000 UTC" />












</head>
<body class="pink">


<div class="container center headings--one-size">

  <header class="header">
  <div class="header__inner">
    <div class="header__logo">
      <a href="https://programmersstone.blog/">
  <div class="logo">
    The Programmer&#39;s Stone
  </div>
</a>

    </div>
    
      <ul class="menu menu--mobile">
  <li class="menu__trigger">Menu&nbsp;▾</li>
  <li>
    <ul class="menu__dropdown">
      
        
          <li><a href="https://programmersstone.blog/about">About</a></li>
        
      
      
    </ul>
  </li>
</ul>

    
    
  </div>
  
    <nav class="navigation-menu">
  <ul class="navigation-menu__inner menu--desktop">
    
      
        
          <li><a href="https://programmersstone.blog/about" >About</a></li>
        
      
      
    
  </ul>
</nav>

  
</header>


  <div class="content">
    
<article class="post">
  <h1 class="post-title">
    <a href="https://programmersstone.blog/posts/easier-recursion/">Easier Recursion</a>
  </h1>
  <div class="post-meta"><time class="post-date">2023-07-23</time><span class="post-author">JEG2</span></div>

  
  


  

  <div class="post-content"><div>
        <p>
I definitely understand the sentiment behind the L. Peter Deutsch quote, &#34;To iterate is human, to recurse divine.&#34;  I enjoy an elegant recursive solution as much as other programmers, but lately I&#39;ve been playing with another style of coding up similar needs that might just be easier and more flexible.</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
The Challenge of Recursion
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>
Let&#39;s use recursion to model <a href="https://www.mathsisfun.com/numbers/fibonacci-sequence.html">The Fibonacci Sequence</a>.  We&#39;ll say that we would like to be able to fetch a specific number or look at the first several numbers of the sequence.  Here&#39;s what that code could look like:</p>
<div class="src src-elixir">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-elixir" data-lang="elixir"><span style="display:flex;"><span>  <span style="color:#66d9ef">defmodule</span> <span style="color:#a6e22e">FibonacciRecursion</span> <span style="color:#66d9ef">do</span>
</span></span><span style="display:flex;"><span>    <span style="color:#66d9ef">def</span> advance({<span style="color:#66d9ef">nil</span>, <span style="color:#ae81ff">0</span>}), <span style="color:#e6db74">do</span>: {<span style="color:#ae81ff">0</span>, <span style="color:#ae81ff">1</span>}
</span></span><span style="display:flex;"><span>    <span style="color:#66d9ef">def</span> advance({prev, cur}), <span style="color:#e6db74">do</span>: {cur, prev <span style="color:#f92672">+</span> cur}
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>    <span style="color:#66d9ef">def</span> at(seq \\ {<span style="color:#66d9ef">nil</span>, <span style="color:#ae81ff">0</span>}, n)
</span></span><span style="display:flex;"><span>    <span style="color:#66d9ef">def</span> at(seq, <span style="color:#ae81ff">0</span>), <span style="color:#e6db74">do</span>: elem(seq, <span style="color:#ae81ff">1</span>)
</span></span><span style="display:flex;"><span>    <span style="color:#66d9ef">def</span> at(seq, n) <span style="color:#66d9ef">do</span>
</span></span><span style="display:flex;"><span>      seq
</span></span><span style="display:flex;"><span>      <span style="color:#f92672">|&gt;</span> advance()
</span></span><span style="display:flex;"><span>      <span style="color:#f92672">|&gt;</span> at(n <span style="color:#f92672">-</span> <span style="color:#ae81ff">1</span>)
</span></span><span style="display:flex;"><span>    <span style="color:#66d9ef">end</span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>    <span style="color:#66d9ef">def</span> take(seq \\ {<span style="color:#66d9ef">nil</span>, <span style="color:#ae81ff">0</span>}, n, acc \\ [])
</span></span><span style="display:flex;"><span>    <span style="color:#66d9ef">def</span> take(_seq, <span style="color:#ae81ff">0</span>, acc), <span style="color:#e6db74">do</span>: <span style="color:#a6e22e">Enum</span><span style="color:#f92672">.</span>reverse(acc)
</span></span><span style="display:flex;"><span>    <span style="color:#66d9ef">def</span> take(seq, n, acc) <span style="color:#66d9ef">do</span>
</span></span><span style="display:flex;"><span>      take(advance(seq), n <span style="color:#f92672">-</span> <span style="color:#ae81ff">1</span>, [elem(seq, <span style="color:#ae81ff">1</span>) <span style="color:#f92672">|</span> acc])
</span></span><span style="display:flex;"><span>    <span style="color:#66d9ef">end</span>
</span></span><span style="display:flex;"><span>  <span style="color:#66d9ef">end</span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  <span style="color:#a6e22e">FibonacciRecursion</span><span style="color:#f92672">.</span>take(<span style="color:#ae81ff">10</span>) <span style="color:#f92672">|&gt;</span> <span style="color:#a6e22e">IO</span><span style="color:#f92672">.</span>inspect()
</span></span><span style="display:flex;"><span>  <span style="color:#a6e22e">FibonacciRecursion</span><span style="color:#f92672">.</span>at(<span style="color:#ae81ff">9</span>) <span style="color:#f92672">|&gt;</span> <span style="color:#a6e22e">IO</span><span style="color:#f92672">.</span>inspect()</span></span></code></pre></div>
</div>
<pre class="example">
[0, 1, 1, 2, 3, 5, 8, 13, 21, 34]
34
</pre>
<p>
This code separates the <em>business logic</em> (<code>FibonacciRecursion.advance/1</code>) from the interface (<code>FibonacciRecursion.at/2</code> and <code>FibonacciRecursion.take/2</code>).  The interface functions are where we see the recursive approach.</p>
<p>
This works fine, obviously, but there are a few drawbacks.  First, we may need to dream up a new strategy for each way that we want to access this data.  Both existing functions keep dropping a counter to tell when to stop, but one of them also has to build up an accumulator as it works.  We could generalize this by introducing mechanisms to control when to stop and for assembling the output, but that would introduce some additional complexity.  That brings me to another point.</p>
<p>
Recursion very often involves three things at once:</p>
<ul>
<li>The actual work we&#39;re doing (generating Fibonacci numbers)</li>
<li>Checking for the stop case (when our counter reaches some predetermined value)</li>
<li>Creating the desired outcome (keeping track of the last number or building a list of all of them)</li>
</ul>
<p>I struggle to address those elements individually when I&#39;m coding up something complex.  I generally feel like I have to do the whole thing together.  It&#39;s more mental overhead to manage.</p>
<p>
Circling back to the first problem, if we later decide that we want the second set of ten numbers or to find the first number in the sequence over 100, we will have to introduce two new recursion strategies or that generalization layer discussed previously.  The mental overhead continues to rise.</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
There&#39;s an Easier Way
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>
It took me a while, but I think <code>Stream</code> has become one of my favorite modules in Elixir.</p>
<p>
Earlier on I had some weird mental block about thinking that it was similar to <code>Enum</code>, but slower in many cases.  I now know that I was confused on multiple levels.</p>
<p>
First, it&#39;s not <strong>like</strong> an <code>Enum</code>, it <strong>is</strong> an <code>Enum</code> and that&#39;s awesome!  It means that we can use all of the iterators to help us build.</p>
<p>
Also, <code>Stream</code> is not about speed.  It&#39;s about controlling the flow of iteration.  We can use it to transform a list of items one at a time while we search for a specific one that we need and avoid working through the rest of the list after we&#39;ve found it.  We can also use it to build potentially infinite sequences of data.</p>
<p>
The real irony is that — since I&#39;ve figured out how to use <code>Stream</code> properly — I&#39;ve been able to drastically outpace replaced <code>Enum</code> operations on several occasions.</p>
<p>
Let&#39;s focus in on one function of the <code>Stream</code> module to show what all of this means.  A great place to begin is <a href="https://hexdocs.pm/elixir/1.15.2/Stream.html#iterate/2"><code>Stream.iterate/2</code></a>.  This one function isn&#39;t too tough to get the hang of and it can be used in a lot of cases.</p>
<p>
The idea is simple.  You pass <code>Stream.iterate/2</code> two things:</p>
<ul>
<li>Some starting data</li>
<li>A function that turns any given piece of data into the next piece of data, also known as a <em>reducer</em></li>
</ul>
<p>The <code>Stream</code> call returns an <em>enumerable</em> that will infinitely step through the data until it&#39;s instructed to stop.  During iteration it will first return the starting data.  Then it will call the passed function with the starting data and return the result.  Then it will call the passed function with that previous result and return the new result.  And so on.</p>
<pre class="example">
starting -f.(starting)-&gt; result -f.(result)-&gt; next_result -f.(next_result)-&gt; …
</pre>
<p>
The emitted values are the variable contents before each function call in that flow:  <code>starting</code>, <code>result</code>, <code>next_result</code>, …</p>
<p>
Let&#39;s take our first step toward converting our Fibonacci generator to this new model:</p>
<div class="src src-elixir">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-elixir" data-lang="elixir"><span style="display:flex;"><span>  <span style="color:#66d9ef">defmodule</span> <span style="color:#a6e22e">Fibonacci</span> <span style="color:#66d9ef">do</span>
</span></span><span style="display:flex;"><span>    <span style="color:#66d9ef">def</span> stream(seq \\ {<span style="color:#66d9ef">nil</span>, <span style="color:#ae81ff">0</span>}) <span style="color:#66d9ef">do</span>
</span></span><span style="display:flex;"><span>      <span style="color:#a6e22e">Stream</span><span style="color:#f92672">.</span>iterate(seq, <span style="color:#66d9ef">fn</span>
</span></span><span style="display:flex;"><span>        {<span style="color:#66d9ef">nil</span>, <span style="color:#ae81ff">0</span>} <span style="color:#f92672">-&gt;</span> {<span style="color:#ae81ff">0</span>, <span style="color:#ae81ff">1</span>}
</span></span><span style="display:flex;"><span>        {prev, cur} <span style="color:#f92672">-&gt;</span> {cur, prev <span style="color:#f92672">+</span> cur}
</span></span><span style="display:flex;"><span>      <span style="color:#66d9ef">end</span>)
</span></span><span style="display:flex;"><span>    <span style="color:#66d9ef">end</span>
</span></span><span style="display:flex;"><span>  <span style="color:#66d9ef">end</span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  <span style="color:#a6e22e">Fibonacci</span><span style="color:#f92672">.</span>stream()
</span></span><span style="display:flex;"><span>  <span style="color:#f92672">|&gt;</span> <span style="color:#a6e22e">Enum</span><span style="color:#f92672">.</span>take(<span style="color:#ae81ff">5</span>)
</span></span><span style="display:flex;"><span>  <span style="color:#f92672">|&gt;</span> <span style="color:#a6e22e">IO</span><span style="color:#f92672">.</span>inspect()</span></span></code></pre></div>
</div>
<pre class="example">
[{nil, 0}, {0, 1}, {1, 1}, {1, 2}, {2, 3}]
</pre>
<p>
We&#39;re definitely not all the way back to the desired outcome yet, but you can find the sequence hiding in there if you squint a bit.</p>
<p>
What&#39;s more interesting is what isn&#39;t there.  We haven&#39;t had to worry about how we&#39;ll actually stop things so far.  The use of <code>|&gt; Enum.take(5)</code> is just a handy trick that&#39;s available to us, now that we can use the iterators, for peeking in on how things are going.</p>
<p>
We also haven&#39;t decided to care about producing the final output at this point.  As we&#39;ll see shortly, that&#39;s trivial to add on when we&#39;re ready.</p>
<p>
We&#39;ve really just recreated the business logic here, in a slightly different form.  This is about a third of the cognitive load of the recursive interface at this point.  We can worry about those other concerns separately.  We don&#39;t need to solve the whole problem in one move.</p>
<p>
Let&#39;s take those last steps to see it all come together:</p>
<div class="src src-elixir">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-elixir" data-lang="elixir"><span style="display:flex;"><span>  <span style="color:#66d9ef">defmodule</span> <span style="color:#a6e22e">Fibonacci</span> <span style="color:#66d9ef">do</span>
</span></span><span style="display:flex;"><span>    <span style="color:#66d9ef">def</span> stream(seq \\ {<span style="color:#66d9ef">nil</span>, <span style="color:#ae81ff">0</span>}) <span style="color:#66d9ef">do</span>
</span></span><span style="display:flex;"><span>      seq
</span></span><span style="display:flex;"><span>      <span style="color:#f92672">|&gt;</span> <span style="color:#a6e22e">Stream</span><span style="color:#f92672">.</span>iterate(<span style="color:#66d9ef">fn</span>
</span></span><span style="display:flex;"><span>        {<span style="color:#66d9ef">nil</span>, <span style="color:#ae81ff">0</span>} <span style="color:#f92672">-&gt;</span> {<span style="color:#ae81ff">0</span>, <span style="color:#ae81ff">1</span>}
</span></span><span style="display:flex;"><span>        {prev, cur} <span style="color:#f92672">-&gt;</span> {cur, prev <span style="color:#f92672">+</span> cur}
</span></span><span style="display:flex;"><span>      <span style="color:#66d9ef">end</span>)
</span></span><span style="display:flex;"><span>      <span style="color:#f92672">|&gt;</span> <span style="color:#a6e22e">Stream</span><span style="color:#f92672">.</span>map(<span style="color:#66d9ef">fn</span> {_prev, cur} <span style="color:#f92672">-&gt;</span> cur <span style="color:#66d9ef">end</span>)
</span></span><span style="display:flex;"><span>    <span style="color:#66d9ef">end</span>
</span></span><span style="display:flex;"><span>  <span style="color:#66d9ef">end</span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  <span style="color:#75715e"># the two original examples</span>
</span></span><span style="display:flex;"><span>  <span style="color:#a6e22e">Fibonacci</span><span style="color:#f92672">.</span>stream()
</span></span><span style="display:flex;"><span>  <span style="color:#f92672">|&gt;</span> <span style="color:#a6e22e">Enum</span><span style="color:#f92672">.</span>take(<span style="color:#ae81ff">10</span>)
</span></span><span style="display:flex;"><span>  <span style="color:#f92672">|&gt;</span> <span style="color:#a6e22e">IO</span><span style="color:#f92672">.</span>inspect()
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  <span style="color:#a6e22e">Fibonacci</span><span style="color:#f92672">.</span>stream()
</span></span><span style="display:flex;"><span>  <span style="color:#f92672">|&gt;</span> <span style="color:#a6e22e">Enum</span><span style="color:#f92672">.</span>at(<span style="color:#ae81ff">9</span>)
</span></span><span style="display:flex;"><span>  <span style="color:#f92672">|&gt;</span> <span style="color:#a6e22e">IO</span><span style="color:#f92672">.</span>inspect()
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  <span style="color:#75715e"># the considered expansions</span>
</span></span><span style="display:flex;"><span>  <span style="color:#a6e22e">Fibonacci</span><span style="color:#f92672">.</span>stream()
</span></span><span style="display:flex;"><span>  <span style="color:#f92672">|&gt;</span> <span style="color:#a6e22e">Stream</span><span style="color:#f92672">.</span>drop(<span style="color:#ae81ff">10</span>)
</span></span><span style="display:flex;"><span>  <span style="color:#f92672">|&gt;</span> <span style="color:#a6e22e">Enum</span><span style="color:#f92672">.</span>take(<span style="color:#ae81ff">10</span>)
</span></span><span style="display:flex;"><span>  <span style="color:#f92672">|&gt;</span> <span style="color:#a6e22e">IO</span><span style="color:#f92672">.</span>inspect()
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  <span style="color:#a6e22e">Fibonacci</span><span style="color:#f92672">.</span>stream()
</span></span><span style="display:flex;"><span>  <span style="color:#f92672">|&gt;</span> <span style="color:#a6e22e">Enum</span><span style="color:#f92672">.</span>find(<span style="color:#66d9ef">fn</span> n <span style="color:#f92672">-&gt;</span> n <span style="color:#f92672">&gt;</span> <span style="color:#ae81ff">100</span> <span style="color:#66d9ef">end</span>)
</span></span><span style="display:flex;"><span>  <span style="color:#f92672">|&gt;</span> <span style="color:#a6e22e">IO</span><span style="color:#f92672">.</span>inspect()</span></span></code></pre></div>
</div>
<pre class="example">
[0, 1, 1, 2, 3, 5, 8, 13, 21, 34]
34
[55, 89, 144, 233, 377, 610, 987, 1597, 2584, 4181]
144
</pre>
<p>
That may look like a bunch of code, but most of it is examples.  We&#39;ve recreated the two we started with and added on the two possible additions mentioned earlier.  Note how it&#39;s now easy to combine <code>Stream</code> and <code>Enum</code> staples to get at the data any way we can dream up.</p>
<p>
This is possible because we now stream the actual sequence of numbers.  That&#39;s the most significant change in this version:  we add on a call to <code>Stream.map/2</code> to transform the underlying data structure into the numbers that we care about as it iterates.  That&#39;s really all it takes!</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Adopting the Pattern
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>
I&#39;ve used this strategy in a wide range of cases:</p>
<ul>
<li>Analyzing data from <a href="https://hexdocs.pm/elixir/1.15.3/File.html#stream!/3"><code>File.stream!/3</code></a> and <a href="https://hexdocs.pm/csv/CSV.html#decode!/2"><code>CSV.decode!/2</code></a></li>
<li>Ingesting Web API&#39;s</li>
<li>Running simulations until specific criteria are met</li>
<li>Building complex graph and tree data structures</li>
<li>Pathfinding algorithms</li>
</ul>
<p>I take a very similar approach each time.  I start by building a struct that holds all the details of the work that needs doing:  inputs, resources, calculations, caches, stage tracking, partial results, and whatever else it takes.  Then I build a reducer function that can advance the work one step at a time by taking the current struct and returning an updated one.  I end with an iteration pipeline that passes a starting struct and the reducer into something like <code>Stream.iterate/2</code> and uses other iterators to hunt for the expected results.</p>
<p>
There are other great tools hiding in the <code>Stream</code> module.  For example, <a href="https://hexdocs.pm/elixir/1.15.3/Stream.html#unfold/2"><code>Stream.unfold/2</code></a> is an upgraded <code>Stream.iterate/2</code> that I use a lot.  It adds the ability to differentiate between what the stream emits and carries forward as well as the ability for the reducer function to end the stream.  Just remember that those quality of life improvements aren&#39;t strictly needed!  We changed emitted values with <code>Stream.map/2</code> and ended the stream with <code>Enum.find/3</code> in the previous code block.</p>
</div>
</div>
      </div></div>

  
    
  

  
    

  
</article>

  </div>

  
    <footer class="footer">
  <div class="footer__inner">
    
      <div class="copyright">
        <span>© 2023 Powered by <a href="https://gohugo.io">Hugo</a></span>
    
      <span>:: <a href="https://github.com/panr/hugo-theme-terminal" target="_blank">Theme</a> made by <a href="https://github.com/panr" target="_blank">panr</a></span>
      </div>
  </div>
</footer>






<script type="text/javascript" src="https://programmersstone.blog/bundle.min.js"></script>





  
</div>

</body>
</html>
